---
kind: other
id: Methods.T:Autodesk.Revit.DB.InstanceVoidCutUtils
source: html/6329e429-3e60-3afe-2ed6-c2ea244ae48c.htm
---
# InstanceVoidCutUtils Methods

Add a cut to an element using the unattached voids inside a cutting instance.